var RowOfCards = require("./RowOfCards");

class Board {
  constructor() {
    this.Count = 5;
    this.RedImageOne = false;
    this.BlueImageOne = false;
    this.YellowImageOne = false;
    this.RowsOfCards = [];
    this.intializeBoard();
    
  }

  intializeBoard() {
    for (var i = 0; i < this.Count; i++) {
      this.RowsOfCards.push(new RowOfCards());
    }
  }
  
  fillBoard() {
    var allWords = [
    "מאבק","תמנון","נמל","קניון","לייזר","רוק","סילון","בירה","אלוף","סוף",
    "קשת","גר","ראש","חבר","לוייתן","אחר","מורה","כיפה","מליונר","מסחרית",
    "חתול","לבנה","מדבר","חד-קרן","חשבון","אור","דוכיפת","מלחמה","רשת","תת",
    "צופים","חיים","כבד","קוד","רכב","דג","נחש","אוזן-המן","בעל","רגל",
    "פיראט","עוגה","קיץ","קזינו","בשר","דלק","אביר","מדליק","לווין","עבר","מסך",
    "סגור","אש","חפץ","בקבוק","מטר","מלאך","ספר","מראה","קלע","גזר",
    "אוצר","אוכל","בול","חוסר","מלכה","עונש","ספק","קיר","בונה","כפתור",
    "בוחן","חייזר","עקרב","רוח-רפאים","שר","טעם","טיל","תל-אביב","מחילה","צל",
    "סופה","זוהר","סכין","נעימה","שן","עורך-דין","דבר","אופרה","עמוד","קברן",
    "אוגר","רופא","ציפה","זהב","קצב","לונדון","סרט","כתר","אלה","נתיב",
    "גלידה","יחידה","מכשפה","קור","בז","אחוז","ספינה","מנצח","עין","לפיד",
    "קש","כריש","כיסוי","אנטארקטיקה","עיט","מלך","טמבל","מרוצים","קרן","מפה",
    "כפפה","מרגל","נוהג","בית-ספר","אוויר","חול","לב","קול","טוקיו","מצנח",
    "אות","מגדל","בוקר","רב","קנגרו","מוסקבה","פרח","חמה","קשר","בית-כנסת",
    "עץ","פינגווין","דוד","חיות","סירה","תנועה","קטשופ","גב","כביש","חבל",
    "שלג","אמבולנס","חלק","קרצייה","פנים","שוטף","פעמון","חלל","באר-שבע","מוות",
    "רעל","חפרפרת","לשון","פרסה","כסף","רובוט","ענק","שפה","בית חולים","פצצה",
    "מיקרוסקופ","מקור","קנטאור","אורגני","דרך","שורשים","יוון","אמריקה","ריק","מיון",
    "חגים","לוח","ישן","קשה","מעבר","מזל","זרוע","גמד","חתיכה","בר",
    "יורה","אפריקה","שבתאי","הודו","דרקון","גאון","שורש","הקפה","כוח","שיח",
    "מנוף","ברווזן","אבן","גנב","תור","סרטן","לימוזינה","לחש","קו","מיטה",
    "שוט","גשר","משקף","לילה","מרכז","חוט","שיגור","אוכף","מים","מזלג",
    "אשף","סולם","דוב","סיבוב","טבח","ערב","קלף","יד","חריף","עליה",
    "בנק","זריקה","חוף","רווח","כלב","נינג'ה","חג","משפט","שמן","כוכב",
    "חוליה","יער","מטה","חור","פירמידה","תשובה","ארץ","מחשב","צלחת","מקל",
    "שחקן","אי","יום","שדה","לבוש","אלף","נעל","סיכה","אריה","נקודה",
    "עצם","שרשרת","כיכר","שטרודל","כותנה","דינוזאור","חצב","אירופה","מופע","ביגלה",
    "דבק","אולם","זקן","כף","חייל","שקל","סדר","קרח","עלים","ירח",
    "עכביש","בחינה","גיבור-על","טלסקופ","בטח","בית","אוניה","מועדון","מצרים","נס",
    "לוחם","טבעת","אתר","מסלול","אחות","תפוח","להקה","גל","צדק","גיר",
    "מסע","שגרירות","בוקסר","סל","אנגליה","דבש","צרפת","נסיכה","צמיג","דשא",
    "מלון","באר","שבת","ריח","תיק","אורח","ריקוד","פועל","מחט","שוקולד",
    "טייס","מפתח","ביצה","אופן","מדען","אח","משטרה","אב","מסוק","אמן",
    "מעין","ציפורן","עיר","החרמון","חופה","אצטדיון","ים","שרת","ברמודה","חיבור",
    "אפיקומן","חווה","צוללן","כוס","כדור","סוס","אסר","איזור","בסיס","גורד-שחקים",
    "חגורה","הלך","צינור","אקדח","פנדה","עוקץ","כתב","נייר","מאלף","רולטה",
    "שנהב","זמן","אשפה","חוזה","ארנב","מכונית","מקדש","חליל","פרק","סוכן",
    "מאגר","מלח","פחד","פרי","הוליווד","איל","כיסא","מאושר","עכבר","תפר",
    "אורז","מעמד","פה","אולימפוס","בועה","דם","משחק","תיאטרון","אטום","שולחן",
    "תולעת","אגודל","מוצא","מעגל","קל"
  
  ]
  var words = [];
    var row = [];
    while(words.length!=5)
    {
      var rand_number = Math.floor(Math.random() * allWords.length);
      row.push(allWords[rand_number]);
      allWords.splice(rand_number,1);
      if ( row.length == 5){
        words.push(row);
        row =[];
      }
    }
 
     var belongsTo =[];
     var row2 = [];
     
  var arr = [
    {NAME:"neutral",COUNT:7},
    {NAME:"host",COUNT:9,},
    {NAME:"hosted",COUNT:8},
    {NAME:"black",COUNT:1}];
  while(belongsTo.length != 5)
  {
    var rand_number = Math.floor(Math.random() * arr.length);
    //  if ( arr[rand_number].COUNT > 0){
      row2.push(arr[rand_number].NAME);
      arr[rand_number].COUNT--;
    //  }
    if (arr[rand_number].COUNT == 0){
      arr.splice(rand_number,1);
    }
      if ( row2.length == 5){
        belongsTo.push(row2);
        row2 = [];
      }
  }


    var i = 0;
    this.RowsOfCards.forEach((row) => {
      row.fill(words[i], belongsTo[i]);
      i++;
    });
 
  };


  flipCard(card) {
    this.RowsOfCards.forEach((row) => {
      if (row.flipCard(card,this)) return;
    });
  }
  
}
module.exports = Board;
